<?php
/*****************************************************
 * オンラインリンク設定ファイル
 *
 */

//----------------------------------------------------
// プログラム定数
//----------------------------------------------------

// デフォルト画面
define("DEFSCR", "log");

// 管理者セッション識別用
define("AUTHADMIN", "1"); 

//----------------------------------------------------
// ユーザ用設定
//----------------------------------------------------

// アプリケーション名
define("APPNAME", "オンラインリンク"); 

// 1ページ表示数
define("PAGESIZE", "10");           

// 表示文字コード
define("ENCDISP", "UTF-8");         

// DB文字コード
define("ENCDB", "UTF-8");           

//----------------------------------------------------
// 管理者用設定
//----------------------------------------------------

// アプリケーション名      
define("ADMINAPPNAME", "TODO管理");

// 1ページ表示数
define("ADMINPAGESIZE", "10");   

// ID
define("LOGINID", "testid");      

// パスワード
define("LOGINPASS", "testpass");         

//----------------------------------------------------
// データベース設定
//----------------------------------------------------

// DBホスト
define("DBSV", "localhost");

// DBテーブル
define("DBNAME", "todo");

// DBユーザ
define("DBUSER", "root");

// DBユーザパスワード
define("DBPASS", "root");

?>